---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.NoSurfPatternOnWire
source: html/c2553c3a-765b-3ab0-ab3b-2f763239ebbd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.NoSurfPatternOnWire Property

Wire elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Fabric Sheet Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSurfPatternOnWire { get; }
```